package ru.geekbrains.lesson3;

public class Program {

    /**
     *  1. Спроектировать абстрактный класс "Car" у которого должны быть свойства: марка, модель, цвет, тип кузова,
     *  число колес, тип топлива, тип коробки передач, объем двигателя; методы: движение, осбслуживание,
     *  переключение передач, включение фар, включение дворников.
     *
     *  2. Создать конкретный автомобиль путём наследования от класса Car
     *
     *  3. Расширить абстрактный класс Car, добавить метод: подметать улицу. Создать конкретный автомобиль
     *  путем наследования класса Car. Провести проверку принципа SRP.
     *
     *  4. Расширить абстрактный класс Car, добавить метод: включение противотуманных фар, перевозка груза.
     *  Провести проверку принципа OCP.
     *
     *  5. Создать конкретный автомобиль путем наследования класса
     *  Car, определить число колес = 3. Провести проверку принципа LCP.
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}